-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 12, 2019 at 05:54 PM
-- Server version: 10.4.6-MariaDB
-- PHP Version: 7.3.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `upr`
--

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `name`) VALUES
(1, 'Аврен'),
(2, 'Долна баня'),
(3, 'Айтос'),
(4, 'Аксаково'),
(5, 'Алфатар'),
(6, 'Антон'),
(7, 'Антоново'),
(8, 'Априлци'),
(9, 'Ардино'),
(10, 'Асеновград'),
(11, 'Балчик'),
(12, 'Баните'),
(13, 'Банско'),
(14, 'Батак'),
(15, 'Белене'),
(16, 'Белица'),
(17, 'Белово'),
(18, 'Белоградчик'),
(19, 'Белослав'),
(20, 'Берковица'),
(21, 'Благоевград'),
(22, 'Бобов дол'),
(23, 'Бобошево'),
(24, 'Божурище'),
(25, 'Бойница'),
(26, 'Бойчиновци'),
(27, 'Болярово'),
(28, 'Борино'),
(29, 'Борован'),
(30, 'Борово'),
(31, 'Ботевград'),
(32, 'Братя Даскалови'),
(33, 'Брацигово'),
(34, 'Брегово'),
(35, 'Брезник'),
(36, 'Брезово'),
(37, 'Брусарци'),
(38, 'Бургас'),
(39, 'Бяла'),
(40, 'Бяла'),
(41, 'Бяла Слатина'),
(42, 'Варна'),
(43, 'Велики Преслав'),
(44, 'Велико Търново'),
(45, 'Велинград'),
(46, 'Венец'),
(47, 'Ветово'),
(48, 'Ветрино'),
(49, 'Видин'),
(50, 'Враца'),
(51, 'Вълчедръм'),
(52, 'Вълчи дол'),
(53, 'Върбица'),
(54, 'Вършец'),
(55, 'Габрово'),
(56, 'Генерал Тошево'),
(57, 'Георги Дамяново'),
(58, 'Главиница'),
(59, 'Годеч'),
(60, 'Горна Малина'),
(61, 'Горна Оряховица'),
(62, 'Гоце Делчев'),
(63, 'Грамада'),
(64, 'Гулянци'),
(65, 'Гурково'),
(66, 'Гълъбово'),
(67, 'Гърмен'),
(68, 'Две могили'),
(69, 'Девин'),
(70, 'Девня'),
(71, 'Джебел'),
(72, 'Димитровград'),
(73, 'Димово'),
(74, 'Добрич-селска'),
(75, 'Добрич'),
(76, 'Долна Митрополия'),
(77, 'Долни Дъбник'),
(78, 'Долни чифлик'),
(79, 'Доспат'),
(80, 'Драгоман'),
(81, 'Дряново'),
(82, 'Дулово'),
(83, 'Дупница'),
(84, 'Дългопол'),
(85, 'Елена'),
(86, 'Елин Пелин'),
(87, 'Елхово'),
(88, 'Етрополе'),
(89, 'Завет'),
(90, 'Земен'),
(91, 'Златарица'),
(92, 'Златица'),
(93, 'Златоград'),
(94, 'Ивайловград'),
(95, 'Иваново'),
(96, 'Искър'),
(97, 'Исперих'),
(98, 'Ихтиман'),
(99, 'Каварна'),
(100, 'Казанлък'),
(101, 'Кайнарджа'),
(102, 'Калояново'),
(103, 'Камено'),
(104, 'Каолиново'),
(105, 'Карлово'),
(106, 'Карнобат'),
(107, 'Каспичан'),
(108, 'Кирково'),
(109, 'Кнежа'),
(110, 'Ковачевци'),
(111, 'Козлодуй'),
(112, 'Копривщица'),
(113, 'Костенец'),
(114, 'Костинброд'),
(115, 'Котел'),
(116, 'Кочериново'),
(117, 'Кресна'),
(118, 'Криводол'),
(119, 'Кричим'),
(120, 'Крумовград'),
(121, 'Крушари'),
(122, 'Кубрат'),
(123, 'Куклен'),
(124, 'Кула'),
(125, 'Кърджали'),
(126, 'Кюстендил'),
(127, 'Левски'),
(128, 'Лесичово'),
(129, 'Летница'),
(130, 'Ловеч'),
(131, 'Лозница'),
(132, 'Лом'),
(133, 'Луковит'),
(134, 'Лъки'),
(135, 'Любимец'),
(136, 'Лясковец'),
(137, 'Мадан'),
(138, 'Маджарово'),
(139, 'Макреш'),
(140, 'Малко Търново'),
(141, 'Марица'),
(142, 'Медковец'),
(143, 'Мездра'),
(144, 'Мизия'),
(145, 'Минерални бани'),
(146, 'Мирково'),
(147, 'Момчилград'),
(148, 'Монтана'),
(149, 'Мъглиж'),
(150, 'Невестино'),
(151, 'Неделино'),
(152, 'Несебър'),
(153, 'Никола Козлево'),
(154, 'Николаево'),
(155, 'Никопол'),
(156, 'Нова Загора'),
(157, 'Нови пазар'),
(158, 'Ново село'),
(159, 'Омуртаг'),
(160, 'Опака'),
(161, 'Опан'),
(162, 'Оряхово'),
(163, 'Павел баня'),
(164, 'Павликени'),
(165, 'Пазарджик'),
(166, 'Панагюрище'),
(167, 'Перник'),
(168, 'Перущица'),
(169, 'Петрич'),
(170, 'Пещера'),
(171, 'Пирдоп'),
(172, 'Плевен'),
(173, 'Пловдив'),
(174, 'Полски Тръмбеш'),
(175, 'Поморие'),
(176, 'Попово'),
(177, 'Пордим'),
(178, 'Правец'),
(179, 'Приморско'),
(180, 'Провадия'),
(181, 'Първомай'),
(182, 'Раднево'),
(183, 'Радомир'),
(184, 'Разград'),
(185, 'Разлог'),
(186, 'Ракитово'),
(187, 'Раковски'),
(188, 'Рила'),
(189, 'Родопи'),
(190, 'Роман'),
(191, 'Рудозем'),
(192, 'Руен'),
(193, 'Ружинци'),
(194, 'Русе'),
(195, 'Садово'),
(196, 'Самоков'),
(197, 'Самуил'),
(198, 'Сандански'),
(199, 'Сапарева баня'),
(200, 'Сатовча'),
(201, 'Свиленград'),
(202, 'Свищов'),
(203, 'Своге'),
(204, 'Севлиево'),
(205, 'Септември'),
(206, 'Силистра'),
(207, 'Симеоновград'),
(208, 'Симитли'),
(209, 'Ситово'),
(210, 'Сливен'),
(211, 'Сливница'),
(212, 'Сливо поле'),
(213, 'Смолян'),
(214, 'Смядово'),
(215, 'Созопол'),
(216, 'Сопот'),
(217, 'Столична'),
(218, 'Средец'),
(219, 'Стамболийски'),
(220, 'Стамболово'),
(221, 'Стара Загора'),
(222, 'Стражица'),
(223, 'Стралджа'),
(224, 'Стрелча'),
(225, 'Струмяни'),
(226, 'Суворово'),
(227, 'Сунгурларе'),
(228, 'Сухиндол'),
(229, 'Съединение'),
(230, 'Сърница'),
(231, 'Твърдица'),
(232, 'Тервел'),
(233, 'Тетевен'),
(234, 'Тополовград'),
(235, 'Трекляно'),
(236, 'Троян'),
(237, 'Трън'),
(238, 'Трявна'),
(239, 'Тунджа'),
(240, 'Тутракан'),
(241, 'Търговище'),
(242, 'Угърчин'),
(243, 'Хаджидимово'),
(244, 'Хайредин'),
(245, 'Харманли'),
(246, 'Хасково'),
(247, 'Хисаря'),
(248, 'Хитрино'),
(249, 'Цар Калоян'),
(250, 'Царево'),
(251, 'Ценово'),
(252, 'Чавдар'),
(253, 'Челопеч'),
(254, 'Чепеларе'),
(255, 'Червен бряг'),
(256, 'Черноочене'),
(257, 'Чипровци'),
(258, 'Чирпан'),
(259, 'Чупрене'),
(260, 'Шабла'),
(261, 'Шумен'),
(262, 'Ябланица'),
(263, 'Якимово'),
(264, 'Якоруда'),
(265, 'Ямбол');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(50) NOT NULL,
  `password` varchar(100) NOT NULL,
  `city` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `username`, `password`, `city`) VALUES
(1, 'd1317900@urhen.com', '$argon2i$v=19$m=65536,t=4,p=1$dXdqNUI5eVB5RkNJMkFS', 1),
(3, 'test@com.com', '$argon2i$v=19$m=65536,t=4,p=1$anlJcWQxRXpUa1pNZGpz', 4),
(5, 'test@test.com', '$argon2i$v=19$m=65536,t=4,p=1$VFVDYllrLkpDeVdMY01hNA$njLxMsOCQmj5GtWPcQOYH+lDd2N4OZ42ruc0n+58KB0', 3);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=266;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
